{
    "utility" : {
        "donation" : "Display the user's current donation progress for the week. The donation cut off is every Monday at 0100 Zulu (Sunday at 2000 EST). The command takes an optional discord user argument to query that user instead.",
        "help" : "Display this help menu. Depending on your user context and the channel that you are it'll show you different portions of the help menu. If you want the whole thing then add the --all or -a argument.",
        "newinvite" : "Provides an invite link to Zulu Base Planning discord server. By default, the link will expire in 10 minutes. The command takes an optional integer argument. The optional integer is used to set the expiration time in minutes for the link.\n\n**[Examples] **\nPanther.Newinvite\nPanther.Newinvite 20",
        "stats" : "Show a graphical output of the user's current Clash of Clans profile. By default, the user who invoked the command will be used to query Clash of Clans. The command takes an optional user argument to query that user instead. In addition, you can add the --max or -m to display max level troops. This will help with knowing if your in-game donation will be max since in-game adds +2 to levels.",
        "top" : "Currently only shows the weekly difference in trophy gains and loses for all users.",
        "report" : "Shows the overall status of the clan as a whole in a HTML file. Using the **optional --discord** flag will prompt the bot to only show the output on discord and not create a HTML file.",
        "OPTIONS" : "All flags that contain double slashes such as --global have a short hand with a single dash and first letter.\n-g = --global\n-d = --discord\n-m = --max"
    },
    "acc" : {
        "listroles" : "List all available roles in Reddit Zulu.",
        "lcm" : "List current members that are in Reddit Zulu. This does a json query of the members in the clan. **Additionally**, clicking the react emoji will display the current number of members registered and how many of those members are of what town hall level.",
        "roster" : "This command identifies every user in the Reddit Zulu discord server that has the 'CoC Members' role and checks if they exist in Zulu Base Planning discord server and in the Database. The command will query if the user is present in Reddit Zulu (clan) only if the user exists in the database. **Additionally**, clicking the react emoji will invoke a sub command that queries all active users to find their current location. It will report back if they are either in one of the three Zulu clans, a different clans(RCS events) or in no clans."
    },
    "admin" : {
        "user_add" : "Register a new user to the database. It is mandatory to supply the user's clash tag and d_user arguments when invoking this command. Registering the user will change the user's nickname on discord to their in-game name along with assigning 'CoC Members' and 'th#s' roles. **Additionally**, you can overwrite the FIN value of the new registered user.",
        "user_remove" : "Set the users active status to false followed by removing any CoC related roles on discord. The command does not kick the user from discord.",
        "queue" : "Used to display any pending apps in the past three days. This works by scraping the Leadership bots message in the channel. You can then used the lookup tool to get their discord ID. The intent is to speed up `user_add` work flows.",
        "add_note" : "Append an administrative note to the users SQL table. The bot **will** automatically append the date and the user who added the note.",
        "delete_note" : "Used to delete a users note in the database. This is the only way to fix errors. It is best to first `panther.viewnote` to copy the content you still want to keep and then `panther.addnote` to add the correct content.",
        "lookup" : "Look up a user either **--global** or **-g** which means finding a user on discord. Or looking up a user with **--name** or **-n** which means looking up a user who has been registered even if this user is inactive. **Additionall**, both commands will have a available react emoji that will paste their discord id and/or their clash tag. Making it easier to copy and paste for commands such as `Panther.user_add`.",
        "view_note" : "View the text note in the user's profile with the option of retrieving any messages identified in the notes. These messages are identified by scanning for the 'msgID:' key.",
        "get_message" : "Used to manually retrieve a msgID. This command is mostly used to diagnose bugs."
    }
}